const Seed = () => {
    return (
        <div className="seed">
            <div className="container">
                <h2 className="title title_white left-leaf">Насіння</h2>
                <p className="seed__p">
                    Вирощування овочів, квітів на своїй ділянці або просто на балконі - це улюблене заняття багатьох
                    дачників та городників. Звичайно, свіжі овочі з власного городу натуральні, смачні та корисні. Але
                    щоб отримати хороший урожай томату або капусти, насолоджуватися цвітінням петунії або троянди,
                    важливо не тільки правильно доглядати за рослинами. Все починається із вибору посівного матеріалу. І
                    тут постає питання: яке насіння вибрати? Адже вони мають бути якісними, давати гарну схожість.
                </p>
                <p className="seed__p">
                    Предлагаем покупателям широкий выбор семян овощей. У нас вы можете найти семена баклажан, разных
                    видов капусты, бобовых и бахчевых культур, томата, перца, огурцов, лука, салата, чеснока, картофеля
                    от отечественных и зарубежных производителей.
                </p>
                {document.documentElement.clientWidth > 730 ? (
                    <>
                        <p className="seed__p">
                            Также вы можете найти в нашем каталоге семена цветов: однолетних (петуния, львиный зев,
                            календула и т.д.), двулетних (виола, примула, мальва), многолетних (иберис, анемона,
                            гибискус, дельфиниум, фрезия), луковичных (тюльпаны, лилия, ирис, нарциссы), комнатных
                            (гербера, бегония, кактус, мимоза, пасифлора). Конечно, это далеко не весь список — каждая
                            хозяйка найдет здесь свой любимый цветок.
                        </p>
                        <p className="seed__p">
                            В широком ассортименте представлены саженцы плодовых деревьев, роз, ягодных кустов. У нас вы
                            можете купить семена газонной травы, а также сопутствующие товары: удобрения, средства
                            защиты, биопрепараты, садовый инвентарь, субстраты, грунты, агроволокно, горшки, кассеты для
                            рассады.
                        </p>
                    </>
                ) : null}

                <h4 className="seed__more arrow_dropdown">Читати повністю</h4>
            </div>
        </div>
    );
};

export default Seed;
